## 6.1 读写文本格式的数据

In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame ({'a' : np.random.randn(6),
             'b' : ['foo', 'bar'] * 3,
             'c' : np.random.randn(6)})
df

          a    b         c
0  0.785588  foo -0.987635
1  0.393078  bar -0.659349
2 -0.045571  foo  0.967106
3 -0.613611  bar -0.595521
4 -0.281718  foo  0.218962
5 -1.863059  bar  0.303793

In [4]:
def my_test(a, b):
    return a + b

In [5]:
df['Value'] = df.apply(lambda row: my_test(row['a'], row['c']), axis=1)

In [6]:
df

          a    b         c     Value
0  0.785588  foo -0.987635 -0.202047
1  0.393078  bar -0.659349 -0.266271
2 -0.045571  foo  0.967106  0.921535
3 -0.613611  bar -0.595521 -1.209133
4 -0.281718  foo  0.218962 -0.062756
5 -1.863059  bar  0.303793 -1.559266

In [7]:
df = pd.read_csv('examples/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [11]:
pd.read_table('examples/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [13]:
pd.read_csv('examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [14]:
pd.read_csv('examples/ex2.csv')

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [15]:
pd.read_csv('examples/ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [16]:
names = ['a', 'b', 'c', 'd', 'message']

In [17]:
pd.read_csv('examples/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [18]:
parsed = pd.read_csv('examples/csv_mindex.csv',
                    index_col=['key1', 'key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [25]:
list(open('examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [32]:
result = pd.read_table('examples/ex3.txt', sep='\s+')

In [33]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [34]:
pd.read_csv('examples/ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [35]:
result = pd.read_csv('examples/ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [36]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [37]:
result = pd.read_csv('examples/ex5.csv', na_values=['NULL'])
# 将指定值替换成缺失值
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [38]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [39]:
pd.read_csv('examples/ex5.csv', na_values=sentinels)
# 只将指定列的值替换为缺失值

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

### 逐块读取文本文件

In [42]:
result = pd.read_csv('examples/ex6.csv')
result

         one       two     three      four key
0  -1.253622  0.061967 -1.079909 -2.560047   L
1   0.573460 -0.312630  0.860925  0.964224   B
2   0.308651  0.789268 -0.320811  0.050726   G
3   1.250492 -0.051986  0.608982 -0.567135   H
4   0.244049 -0.452667 -0.157453 -0.450891   R
5   1.027114 -1.545724  0.260548  0.180903   Q
6   1.445647 -0.463990  0.754998  1.458295   Y
7   0.217461  0.704862  1.427638 -0.040057   H
8  -0.574806 -0.345376  1.795809 -0.863423   D
9   1.304148  0.337558 -0.056520 -1.033049   H
10  2.055250 -1.349474 -0.224293  1.334791   L
11 -1.472411  0.189809  0.955714 -0.004268   M
12  1.401488  0.584419 -0.419952  0.114778   F
13  0.007887 -0.573118  0.261343 -0.601914   Q
14  0.730587 -0.990549 -0.115135  0.240823   W
15 -0.775893  1.104686  1.114838  0.572673   T
16  0.878728  0.383056 -0.146349 -1.842473   R
17 -0.428841 -0.376499  0.495430  0.552490   D
18 -1.076649 -1.247870 -0.353647 -0.383651   G
19 -0.652175  1.175173 -0.219291 -0.413533   S
20 -2.508528  0.044073  0.180065 -0.359607   S
21 -0.764890 -0.742525  1.239318 -0.624413   G
22  0.169131 -0.828696  0.745130 -0.496846   T
23 -0.014037  0.560210  0.827149  0.312166   E
24  2.201572 -0.558731 -2.090283  0.422005   W
25  1.883115  0.890470 -0.330111  0.326243   Y
26  0.618567 -0.095770  0.636818 -1.171682   I
27 -1.189647  1.381893  0.140809 -0.415471   J
28  2.014634  0.108347 -0.740285 -0.669881   G
29 -1.688452 -0.821191 -0.093038  1.338211   Y

In [43]:
pd.read_csv('examples/ex6.csv', nrows=5)

        one       two     three      four key
0 -1.253622  0.061967 -1.079909 -2.560047   L
1  0.573460 -0.312630  0.860925  0.964224   B
2  0.308651  0.789268 -0.320811  0.050726   G
3  1.250492 -0.051986  0.608982 -0.567135   H
4  0.244049 -0.452667 -0.157453 -0.450891   R

In [63]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=10)

In [64]:
chunker

In [65]:
tot = pd.Series([])
tot

Series([], dtype: float64)

In [66]:
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)

tot = tot.sort_values(ascending=False)

In [68]:
tot

G    4.0
Y    3.0
H    3.0
W    2.0
T    2.0
S    2.0
R    2.0
Q    2.0
L    2.0
D    2.0
M    1.0
J    1.0
I    1.0
F    1.0
E    1.0
B    1.0
dtype: float64

### 将数据写出到文本格式

In [69]:
data = pd.read_csv('examples/ex5.csv')

In [70]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [71]:
data.to_csv('examples/out.csv')

In [72]:
import sys

In [73]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [74]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [75]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [76]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [77]:
dates = pd.date_range('1/1/2000', periods=7)
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

In [78]:
ts = pd.Series(np.arange(7), index=dates)
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int32

In [79]:
ts.to_csv('examples/tseries.csv')

### 处理分隔符格式

In [80]:
import csv

In [85]:
f = open('examples/ex7.csv')
reader = csv.reader(f)

In [83]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [88]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))

In [89]:
header, values = lines[0], lines[1:]

In [90]:
header

['a', 'b', 'c']

In [91]:
values

[['1', '2', '3'], ['1', '2', '3']]

In [94]:
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [97]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL
    
f = open('examples/ex7.csv')
reader = csv.reader(f, dialect=my_dialect)

In [98]:
reader = csv.reader(f, delimiter='|')

In [102]:
with open('examples/mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4', '5', '6'))
    writer.writerow(('7', '8', '9'))

### JSON数据

In [103]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [105]:
import json

In [106]:
result = json.loads(obj)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [107]:
asjson = json.dumps(result)

In [108]:
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [109]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [110]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [113]:
pd.DataFrame(result['siblings'])

   age   name                    pets
0   30  Scott            [Zeus, Zuko]
1   38  Katie  [Sixes, Stache, Cisco]

In [115]:
data = pd.read_json('examples/example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [116]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [117]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

### XML和HTML: Web信息收集

## 6.2 二进制数据格式

In [118]:
frame = pd.read_csv('examples/ex1.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [119]:
frame.to_pickle('examples/frame_pickle')

In [127]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

### 使用HDF5格式

In [129]:
frame = pd.DataFrame({'a': np.random.randn(100)})

In [130]:
store = pd.HDFStore('examples/mydata.h5')

In [131]:
store['obj1'] = frame

In [132]:
store['obj1_col'] = frame['a']

In [133]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: examples/mydata.h5

In [134]:
store['obj1']

           a
0   1.026873
1  -1.555870
2  -0.550372
3   0.622621
4   1.098121
5   2.920575
6   1.005420
7   1.242829
8  -0.193977
9  -0.308152
10  0.044946
11  1.825912
12  0.439497
13  0.268889
14 -0.127923
15  1.480861
16 -0.297391
17  0.782112
18 -0.519803
19 -0.465895
20  0.715888
21 -1.885143
22  0.551586
23  1.196610
24  0.186231
25  0.376740
26  1.002047
27 -0.456418
28 -0.282903
29 -0.394704
..       ...
70 -0.913814
71  0.630563
72  0.217137
73  0.049360
74  0.901026
75 -1.402733
76 -0.245470
77 -0.952072
78  0.759275
79  0.117936
80 -1.561508
81 -0.084108
82 -0.303225
83  0.734500
84  1.416764
85  1.651780
86  1.501872
87 -2.048372
88  0.287336
89 -0.448638
90  0.767781
91 -0.879642
92  1.208618
93  0.271427
94 -2.627151
95 -0.157356
96 -0.330582
97 -0.090649
98 -1.567756
99 -0.692572

[100 rows x 1 columns]

In [135]:
store.put('obj2', frame, format='table')

In [136]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10  0.044946
11  1.825912
12  0.439497
13  0.268889
14 -0.127923
15  1.480861

In [137]:
store.close()

In [138]:
frame.to_hdf('mydata.h5', 'obj3', format='table')

In [139]:
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0  1.026873
1 -1.555870
2 -0.550372
3  0.622621
4  1.098121

### 读取Microsoft Excel文件

In [148]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')

In [149]:
pd.read_excel(xlsx, 'Sheet1')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [151]:
frame = pd.read_excel('examples/ex1.xlsx', 'Sheet1')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [152]:
writer = pd.ExcelWriter('examples/ex2.xlsx')

In [153]:
frame.to_excel(writer, 'Sheet1')

In [154]:
writer.save()

In [155]:
frame.to_excel('examples/ex2.xlsx')

## 6.3 Web APIs交互

In [156]:
import requests

In [157]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [158]:
resp = requests.get(url)

In [159]:
resp

In [160]:
data = resp.json()

In [161]:
data[0]['title']

'BUG: bugfix 26390 assigning PandasArray to DataFrame error'

In [162]:
issues = pd.DataFrame(data, columns=['number', 'title', 'labels', 'state'])

In [163]:
issues

,number,title,labels,state
0,26417,BUG: bugfix 26390 assigning PandasArray to Dat...,"[{'id': 49094459, 'node_id': 'MDU6TGFiZWw0OTA5...",open
1,26416,"CLN: remove __unicode__ from pyx, etc. files","[{'id': 49747336, 'node_id': 'MDU6TGFiZWw0OTc0...",open
2,26415,CLN: remove __unicode__ from pandas.core.dtypes,"[{'id': 49747336, 'node_id': 'MDU6TGFiZWw0OTc0...",open
3,26414,WIP: Split matplotlib specific code from panda...,"[{'id': 127681, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
4,26412,Using .loc.__setitem__ with integer slices doe...,[],open
5,26411,"Grouping, then resampling empty DataFrame lead...","[{'id': 233160, 'node_id': 'MDU6TGFiZWwyMzMxNj...",open
6,26410,"API: getting the ""densified"" values of a Categ...","[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open
7,26409,DEPR: deprecate get_values,[],open
8,26408,BUG: MultiIndex not dropping nan level and inv...,"[{'id': 2822342, 'node_id': 'MDU6TGFiZWwyODIyM...",open
9,26407,SparseArrays backed by other Extension array/d...,"[{'id': 849023693, 'node_id': 'MDU6TGFiZWw4NDk...",open
10,26406,BUG: to_numpy on categorical data with tz awar...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
11,26405,DEPR: deprecate Series/DataFrame.compound,"[{'id': 87485152, 'node_id': 'MDU6TGFiZWw4NzQ4...",open
12,26404,Fix type annotations in pandas.core.indexes.da...,"[{'id': 1280988427, 'node_id': 'MDU6TGFiZWwxMj...",open
13,26403,DEPR: Deprecate ordered=None for CategoricalDtype,"[{'id': 78527356, 'node_id': 'MDU6TGFiZWw3ODUy...",open
14,26400,ENH: Support multiple opening hours intervals ...,[],open
15,26399,ENH: Support nested renaming / selection,"[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open
16,26398,Fix type annotations in pandas.core.resample,"[{'id': 74975453, 'node_id': 'MDU6TGFiZWw3NDk3...",open
17,26397,DataFrame.describe excludes top and freq for e...,[],open
18,26395,different type conversion results in assignmen...,"[{'id': 31404521, 'node_id': 'MDU6TGFiZWwzMTQw...",open
19,26394,BUG: to_numeric does not validate the errors k...,"[{'id': 42670965, 'node_id': 'MDU6TGFiZWw0MjY3...",open
20,26393,Holiday based on the lunar calendar?,[],open
21,26392,[TEST] Add two more parameters to the test_dti...,"[{'id': 53181044, 'node_id': 'MDU6TGFiZWw1MzE4...",open
22,26391,[PERF] Get rid of MultiIndex conversion in Int...,"[{'id': 150096370, 'node_id': 'MDU6TGFiZWwxNTA...",open
23,26390,BUG: assigning Series.array / PandasArray to c...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
24,26389,Converting json to csv,"[{'id': 307649777, 'node_id': 'MDU6TGFiZWwzMDc...",open
25,26388,read_parquet S3 dir support,"[{'id': 685114413, 'node_id': 'MDU6TGFiZWw2ODU...",open
26,26385,GroupBy nth ignores observed keyword for Categ...,"[{'id': 78527356, 'node_id': 'MDU6TGFiZWw3ODUy...",open
27,26381,BUG: error calculating BusinessHourMixin.apply...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
28,26380,ENH: Implementing NEP 18's __array_function__,[],open
29,26379,BUG: Series.combine_first with mixed timezones,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open

### 6.4 数据库交互

In [164]:
import sqlite3

In [165]:
query = """
        CREATE TABLE test
        (a VARCHAR(20), b VARCHAR(20),
        c REAL,        d INTEGER
        );"""

In [166]:
con = sqlite3.connect('mydata.sqlite')

In [167]:
con.execute(query)

In [168]:
con.commit()

In [169]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]

In [173]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [174]:
con.executemany(stmt, data)

In [175]:
cursor = con.execute('select * from test')

In [176]:
rows = cursor.fetchall()

In [177]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [178]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [179]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [180]:
import sqlalchemy as sqla

In [181]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [182]:
pd.read_sql('select * from test', db)

Empty DataFrame
Columns: [a, b, c, d]
Index: []